app/controllers/postcomments_controller.rb

SELECT  "events".* FROM "events"  WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "postcomments" ("body", "created_at", "event_id", "updated_at", "user_name") VALUES (?, ?, ?, ?, ?)  [["body", "how are you today?"], ["created_at", "2016-01-09 01:29:47.524949"], ["event_id", 3], ["updated_at", "2016-01-09 01:29:47.524949"], ["user_name", "pmorana@gmail.com"]]
---
	def create
		@event = Event.find(params[:event_id])
		@postcomment = @event.postcomments.create(postcomment_params)

SELECT  "events".* FROM "events"  WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "postcomments".* FROM "postcomments"  WHERE "postcomments"."event_id" = ? AND "postcomments"."id" = ? LIMIT 1  [["event_id", 1], ["id", 1]]
DELETE FROM "postcomments" WHERE "postcomments"."id" = ?  [["id", 1]]
---
	def destroy
		@event = Event.find(params[:event_id])
		@postcomment = @event.postcomments.find(params[:id])
		@postcomment.destroy